<?php
/**
 * @Auth: wonli <wonli@live.com>
 */
return array(
    100000 => '操作成功',
    100001 => '帐号已禁用',
    100002 => '用户名或密码不能为空',
    100003 => '密码验证失败',
    100004 => '请输入正确的安全码',
    100005 => '安全码认证失败',
    100006 => '请确认数据是否导入',

    100007 => '原密码错误',
    100008 => '两次输入的密码必须一致',
    100009 => '更改密码失败',

    100010 => '你已经绑定过密保卡了',
    100011 => '绑定过密保卡成功',
    100012 => '绑定过密保卡失败,请联系管理员',
    100013 => '请先绑定密保卡',
    100014 => '重置密保卡失败,请联系管理员',
    100015 => '密保卡已过期',
    100016 => '解除密保卡绑定成功',
    100017 => '密保卡解除绑定失败,请联系管理员',

    100018 => '角色名不能为空',
    100019 => '权限菜单不能为空',
    100020 => '已有相同的角色名存在',
    100021 => '添加角色失败',
    100022 => '用户名和权限菜单不能为空',
    100023 => '要编辑的角色ID错误',
    100024 => '编辑角色权限失败,请联系管理员',
    100025 => '没有找到该管理员',
    100026 => '没有发现ACL菜单',

    100030 => '权限不足',

    200000 => '不支持的请求',
    200100 => '请求所需参数不足',
    200210 => '不支持的渠道',
    200220 => '不支持的平台',
    200230 => '请升级您的客户端',
    200240 => '',
    200050 => '无法识别的图片',
    200051 => '图片不能超过3M',
    200052 => '不支持的图片格式',

);
