<?php
/**
 * 状态码管理
 *
 * @Auth: wonli <wonli@live.com>
 */
return array(

    100100 => '请确认数据是否导入',
    100101 => '权限不足',

    100210 => '帐号不存在',
    100211 => '帐号已禁用',
    100212 => '密码验证失败',
    100213 => '用户名或密码不能为空',
    100214 => '更改密码失败',
    100220 => '两次输入的密码必须一致',
    100221 => '原密码错误',
    100230 => '表单输入不完整',

    100300 => '请输入正确的安全码',
    100301 => '安全码认证失败',

    100400 => '没有找到该管理员',
    100410 => '创建管理员失败, 用户名和密码不能为空',
    100411 => '创建管理员失败, 用户名已存在',
    100412 => '创建管理员失败, 保存数据时发生错误',
    100420 => '更新理员失败, 用户名重名',
    100430 => '删除管理员失败',

    100500 => '您已经绑定过密保卡了',
    100501 => '绑定密保卡失败,请联系管理员',
    100502 => '重置密保卡失败,请联系管理员',
    100503 => '请先绑定密保卡',
    100510 => '密保卡已过期',
    100520 => '密保卡解绑失败,请联系管理员',
    100521 => '为了系统安全, 管理员已禁止解绑密保卡',

    100610 => '角色名不能为空',
    100620 => '权限菜单不能为空',
    100630 => '角色不能重名',
    100640 => '添加角色失败',
    100650 => '没有找到要编辑的角色信息',
    100660 => '编辑角色权限失败,请联系管理员',
    100670 => '用户名和权限菜单不能为空',
    100680 => '没有ACL菜单',

    200000 => '不支持的请求',
    200100 => '请求所需参数不足',
    200210 => '不支持的渠道',
    200220 => '不支持的平台',
    200230 => '请升级您的客户端',
    200240 => '',
    200050 => '无法识别的图片',
    200051 => '图片不能超过3M',
    200052 => '不支持的图片格式',

);
